//input maps
const inputMappings = {
	malayalam:{
	 "അ" : "A", "ആ" : "Ā", "ഇ" : "I", "ഈ" : "Ī", "ഉ" : "U", "ഊ":"Ū", "എ" : "E", "ഏ" : "Ē",
	 "ഐ" : "AI", "ഒ" : "O", "ഓ" : "Ō", "ഔ" : "AU", "ഃ" : "ḥ", "ഋ" : "R̥","ഌ" : "L̥",
	 "ൠ" : "R̥̄","ൟ":"Ī", "ൡ" : "L̥̄", "്" : "ŭ", 
	 //വല്ലിനം
	 "ക" : "ka","ഖ" : "kha","ഗ" : "ga","ഘ" : "gha",
	 "ച" : "ca","ഛ" : "cha","ജ" : "ja","ഝ" : "jha",
	 "ട" : "ṭa", "ഠ" : "ṭha","ഡ" : "ḍa", "ഢ" : "ḍha",
	 "ത" : "ta", "ഥ" : "tha", "ദ" : "da","ധ" : "dha",
	 "പ" : "pa", "ഫ" : "pha","ബ" : "ba","ഭ" : "bha",
	 "റ" : "ṟa",'ഺ' : 'ṯa',
	 //മെല്ലിനം
	 "ങ" : "ṅa","ഞ" : "ña","ണ" : "ṇa","ന" : "n̪a",'ഩ' : 'ṉa',
	 "മ" : "ma",
	 //ഇടയിനം
	 "യ" : "ya","ര" : "ra","ല" : "la","ള" : "ḷa","ഴ" : "ḻa","വ" : "va",
	 //മറ്റിനം
	 "സ":"sa","ശ":"śa","ഷ" : "ṣa","ഹ":"ha",
	//ചില്ലുകൾ
	 'ൿ':'k','ൺ':'ṇ','ൻ':'ṉ','ർ':'r','ൽ':'l','ൾ':'ḷ',
	 'ൔ' : 'm', 'ൕ' : 'y', 'ൖ' : 'ḻ',
	//ചുട്ടികൾ
	'ഀ' : 'ṁ', 'ം':'ṁ', 'ഄ' : 'ṁ',
	'഻' : '', '഼' : '', 'ാ' : 'ā', 'ി' : 'i','ീ':'ī','ു':'u','ൂ':'ū',
	'െ':'e','േ':'ē','ൊ':'o','ോ':'ō','ൈ':'ai','ൌ':'au','ൗ':'au',
	'ൃ' : 'r̥', 'ൄ':'r̥̄','ൢ':'l̥','ൣ':"l̥̄"
	},
	kannada:{
		//ഉയിരെഴുത്ത്                
	 "ಅ" : "A", "ಆ" : "Ā", "ಇ" : "I", "ಈ" : "Ī", "ಉ" : "U", "ಊ":"Ū", "ಎ" : "E", "ಏ" : "Ē",
	 "ಐ" : "AI", "ಒ" : "O", "ಓ" : "Ō", "ಔ" : "AU", "ಃ" : "ḥ", "ಋ" : "R̥","ಌ" : "L̥",
	 "ೠ" : "R̥̄", "ೡ" : "L̥̄", "್" : "ŭ", 
	 //വല്ലിനം                          
	 "ಕ" : "ka","ಖ" : "kha","ಗ" : "ga","ಘ" : "gha",
	 "ಚ" : "ca","ಛ" : "cha","ಜ" : "ja","ಝ" : "jha",
	 "ಟ" : "ṭa", "ಠ" : "ṭha","ಡ" : "ḍa", "ಢ" : "ḍha",
	 "ತ" : "ta", "ಥ" : "tha", "ದ" : "da","ಧ" : "dha",
	 "ಪ" : "pa", "ಫ" : "pha","ಬ" : "ba","ಭ" : "bha",
	 "ಱ" : "ṟa",'ಫ಼' : 'fa',
 //മെല്ലിനം          
	"ಙ" : "ṅa","ಞ" : "ña","ಣ" : "ṇa","ನ" : "na",
	 "ಮ" : "ma",
	//ഇടയിനം
	 "ಯ" : "ya","ರ" : "ra","ಲ" : "la","ಳ" : "ḷa","ೞ" : "ḻa","ವ" : "va",
	//മറ്റിനം
	 "ಸ":"sa","ಶ":"śa","ಷ" : "ṣa","ಹ":"ha",
//ചുട്ടികൾ
	'ಁ' : 'ṁ', 'ಂ':'ṁ', 'ಀ' : 'ṁ',            
	'ಾ' : 'ā', 'ಿ' : 'i','ೀ':'ī','ು':'u','ೂ':'ū',
	'ೆ':'e','ೇ':'ē','ೊ':'o','ೋ':'ō','ೈ':'ai','ೌ ':'au','ൗ':'au',
	'ೃ' : 'r̥', 'ೄ ':'r̥̄','ೢ':'l̥','ೣ':"l̥̄",
	},
  tamil:{
	 "அ" : "A", "ஆ" : "Ā", "இ" : "I", "ஈ" : "Ī", "உ" : "U", "ஊ":"Ū", "எ" : "E", "ஏ" : "Ē",
	 "ஐ" : "AI", "ஒ" : "O", "ஓ" : "Ō", "ஔ" : "AU", "ஃ" : "ḵ", "்" : "ŭ", 
	 //വല്ലിനം
	 "க" : "ka","ச" : "ca","ட" : "ṭa",
	 "த" : "ta","ப" : "pa","ற" : "ṟa",
	 //മെല്ലിനം
	 "ங" : "ṅa","ஞ" : "ña","ண" : "ṇa","ந" : "n̪a",'ன' : 'ṉa',
	 "ம" : "ma",
	 //ഇടയിനം
	 "ய" : "ya","ர" : "ra","ல" : "la","ள" : "ḷa","ழ" : "ḻa","வ" : "va",
	 //മറ്റിനം
	 "ஸ":"sa","ஶ":"śa","ஷ" : "ṣa","ஹ":"ha",
//ചുട്ടികൾ
	'ஂ' : 'ṁ', 
	'ா' : 'ā', 'ி' : 'i','ீ':'ī','ு':'u','ூ':'ū',
	'ெ':'e','ே':'ē','ொ':'o','ோ':'ō','ை':'ai','ௌ':'au','ௗ':'au',
  },
  	telugu:{
		//ഉയിരെഴുത്ത്                
	"అ" : "A", "ఆ" : "Ā", "ఇ" : "I", "ఈ" : "Ī", "ఉ" : "U", "ఊ":"Ū", "ఎ" : "E", "ఏ" : "Ē",
	"ఐ" : "AI", "ఒ" : "O", "ఓ" : "Ō", "ఔ" : "AU", "ః" : "ḥ", "ఋ" : "R̥","ఌ" : "L̥",
	"ౠ" : "R̥̄", "ౡ" : "L̥̄", "్" : "ŭ", 
	 //വല്ലിനം                          
	"క" : "ka","ఖ" : "kha","గ" : "ga","ఘ" : "gha",
	"చ" : "ca","ఛ" : "cha","జ" : "ja","ఝ" : "jha",
	"ట" : "ṭa", "ఠ" : "ṭha","డ" : "ḍa", "ఢ" : "ḍha",
	"త" : "ta", "థ" : "tha", "ద" : "da","ధ" : "dha",
	"ప" : "pa", "ఫ" : "pha","బ" : "ba","భ" : "bha",
	"ఱ" : "ṟa",
//മെല്ലിനം
	"ఙ" : "ṅa","ఞ" : "ña","ణ" : "ṇa","న" : "na",
	"మ" : "ma",
	//ഇടയിനം
	"య" : "ya","ర" : "ra","ల" : "la","ళ" : "ḷa","ఴ" : "ḻa","వ" : "va",
	//മറ്റിനം
	"స":"sa","శ":"śa","ష" : "ṣa","హ":"ha","ౘ":"tsa","ౙ":"za",
	//ചുട്ടികൾ
	'ఀ' : 'ṁ', 'ం':'ṁ', 'ಀ' : 'ṁ',
	'ా' : 'ā', 'ి' : 'i','ీ':'ī','ు':'u','ూ':'ū',
	'ె':'e','ే':'ē','ొ':'o','ో':'ō','ై':'ai','ౌ ':'au','ൗ':'au',
	'ృ' : 'r̥', 'ౄ ':'r̥̄','ౢ':'l̥','ౣ':"l̥̄",          

	},
	
};

const outputMappings = {
	iso : {
	"A" : "a", "Ā" : "ā", "I" : "i", "Ī" : "ī", "U" : "u", "Ū" : "ū", "E" : "e",
	"Ē" : "ē", "AI" : "Ai", "O" : "o", "Ō" : "ō", "AU" : "Au", "R̥" : "r̥", "L̥" : "l̥",
	"L̥̄" : "l̥̄", "R̥̄" :"r̥̄", 
	},
	ipa : {
	"A" : "a", "Ā" : "aː", "I" : "i", "Ī" : "iː", "U" : "u", "Ū" : "uː", "E" : "e",
	"ā": "aː", "ī" : "iː", "ū" : "uː", "ē" : "eː","ō" : "oː",
 	"Ē" : "eː", "AI" : "Ai", "O" : "o", "Ō" : "oː", "AU" : "Au", "R̥" : "r̩", "L̥" : "lɨː",
 	"r̥":"r̩","r̥̄" : "r̩ː","l̥" : "l̩","l̥̄" : "l̩ː", "ŭ" : "ɨ̆",
 	"L̥̄" : "l̩ː", "R̥̄" :"r̩ː",  "ṁ" : 'm', 'ḥ' : 'h',

 	"kha" : "kʰa","gha" : "ɡʱa", "ṅa" : "ŋa",
 	"ca" : "t͡ʃa","cha" : "t͡ʃʰa","ja" : "d͡ʒa", "jha" : "d͡ʒʱa", "ña" : "ɲa",
 	"ṭa" : "ʈa", "ṭha" : "ʈʰa", "ḍa" : "ɖa", "ḍha" : "ɖʰa", "ṇa" : "ɳa",
 	"ta" : "t̪a","tha" : "t̪ʰa","da" : "d̪a","dha" : "d̪ʰa","na":"n̪a",
 	"pha" : "pʰa","bha" : "bʰa",
 	"ya" : "ja","ra" : "ɾa","va" : "ʋa","ṉa":"na", 
 	"ḷa" : "ɭa", "ḻa" : "ɻa", "ṟa" : "ra", "śa" : "ʃa", "sa" : "s̪a", "ṣa" : "ʂa",
 	"ha" : "ɦa",
},
};


//punctuations
const punctuationRules = {
	iso: { '(aŭ)([.,!?;:()\\[\\]{} ])': '$1$2' },
	isoMal: { '(aŭ)([.,!?;:()\\[\\]{} ])': '$1ŭ$2' },
	ipa: { '(aɨ̆)([.,!?;:()\\[\\]{} ])': '$1$2' },
	ipaMal: { '(aɨ̆)([.,!?;:()\\[\\]{} ])': '$1ɨ̆$2' },
}
//feature rules
const featureRules = {
	iso : {
	'aā' : 'ā','ai' : 'i','aī' : 'ī','au' : 'u','aū' : 'ū','ao' : 'o',
	'ae' : 'e','aē' : 'ē',
	'aō' : 'ō','ar̥' :'r̥','al̥' :'l̥','al̥̄' :'l̥̄','ar̥̄' :'r̥̄',
	'aŭ':'', "n̪" : "n",'Au':"au","Ai":"ai",
	},
	isoKn : {
	'ṁ':'m',
	'mk' : 'ṅk',  'mkh' : 'mkh',  'mg' : 'ṅg',  'mgh' : 'ṅgh',
	'mc' : 'ñc',  'mch' : 'ñch',  'mj' : 'ñj',  'mjh' : 'ñjh',
	'mṭ' : 'ṇṭ',  'mṭh' : 'ṇṭh',  'mḍ' : 'ṇḍ',  'mḍh' : 'ṇḍh',
	'mt' : 'nt',  'mth' : 'nth',  'md' : 'nd',  'mdh' : 'ndh',
	},
	isoMal : {
	'ṁ':'m','mk' : 'ṅk',  'mkh' : 'ṅkh',  'mg' : 'ṅg',  'mgh' : 'ṅgh',
	"ṟṟ" : "ṯṯ","nṟ" : "nṯ","nt" : "ṉt",
	"nm":"ṉm","nṉm":"nnm","np":"ṉp","nṉp":"nnp","na":"ṉa","nṉa":"nna","nā":"ṉā","nṉā":"nnā",
	"ni":"ṉi","nṉi":"nni","nī":"ṉī","nṉī":"nnī","nu":"ṉu","nṉu":"nnu","nū":"ṉū","nṉū":"nnū",
	"ne":"ṉe","nṉe":"nne","nē":"ṉē","nṉē":"nnē","no":"ṉo","nṉo":"nno","nō":"ṉō","nṉō":"nnō",
	"nŭ":"ṉŭ","nṉŭ":"nnŭ",
    " ṉa":" na"," ṉā":" nā"," ṉi":" ni"," ṉī":" nī"," ṉu":" nu"," ṉū":" nū",
    " ṉe":" ne"," ṉē":" nē"," ṉo":" no"," ṉō":" nō"," ṉŭ":" nŭ",
	},
	ipa : {
	'aaː' : 'aː','ai' : 'i','aiː' : 'iː','au' : 'u','auː' : 'uː','ao' : 'o',
	'ae' : 'e','aeː' : 'eː',
	'aoː' : 'oː','ar̩' :'r̩','al̩' :'l̩ː','al̩ː' :'l̩ː','ar̩ː' :'r̩ː',
	'aɨ̆':'',"n̪" : "n",'Au':"au","Ai":"ai",
	},
	ipaKn : {
	'mk': 'ŋk', 'mkh': 'ŋkh', 'mg': 'ŋg', 'mgh': 'ŋgh',
	'mt͡ʃ': 'ɲt͡ʃ', 'mt͡ʃʰ': 'ɲt͡ʃʰ', 'md͡ʒ': 'ɲd͡ʒ', 'md͡ʒʱ': 'ɲd͡ʒʱ',
	'mʈ': 'ɳʈ', 'mʈʰ': 'ɳʈʰ', 'mɖ': 'ɳɖ', 'mɖʰ': 'ɳɖʰ',
	'mt̪': 'nt̪', 'mt̪ʰ': 'nt̪ʰ', 'md̪': 'nd̪', 'md̪ʰ': 'nd̪ʰ',
	},
	ipaMal : {
	'mk' : 'ŋk',  'mkh' : 'ŋkh',  'mg' : 'ŋg',  'mgh' : 'ŋgh',
	"rr" : "tt","nr" : "nt","ṉ":"n",

	"nna":"n̪n̪a",
	"nnā":"n̪n̪ā","nni":"n̪n̪i","nnu":"n̪n̪u","nnū":"n̪n̪ū",
	"nnē":"n̪n̪ē","nno":"n̪n̪o","nnō":"n̪n̪ō","nnɨ":"n̪n̪ɨ",
		
	" na":" n̪a"," nā":" n̪ā"," ni":" n̪i",
	" nī":" n̪ī"," nu":" n̪u"," nū":" n̪ū"," ne":" n̪e",
	" nē":" n̪ē"," no":" n̪o"," nō":" n̪ō"," nɨ":" n̪ɨ",
	},
	
};

export{inputMappings,outputMappings,punctuationRules,featureRules};
//is it possible to nest teh special rules? 
