const DravISO = {
    //മലയാളം ഉയിരെഴുത്തുകൾ
    'അ':'A','ആ':'Ā','ഇ':'I','ഈ':'Ī','ൟ':'Ī','ഉ':'U','ഊ':'Ū',
    'എ':'E','ഏ':'Ē','ഒ':'O','ഓ':'Ō','ഐ':'AI','ഔ':'AU',
    'ഋ':'RRU','ൠ':'RRUU','ഌ':'LLU','ൡ':'LLUU',
    //തമിഴ് ഉയിരെഴുത്തുകൾ
    'அ':'A','ஆ':'Ā','இ':'I','ஈ':'Ī','உ':'U','ஊ':'Ū',
    'எ':'E','ஏ':'Ē','ஒ':'O','ஓ':'Ō','ஐ':'AI','ஔ':'AU',
    'ருʼ':'RRU','ரூʼ':'RRUU','லுʼ':'LLU','லூʼ':'LLUU',
    //തെലുങ്ക് ഉയിരെഴുത്തുകൾ
    'అ':'A','ఆ':'Ā','ఇ':'I','ఈ':'Ī','ఉ':'U','ఊ':'Ū',
    'ఎ':'E','ఏ':'Ē','ఒ':'O','ఓ':'Ō','ఐ':'AI','ఔ':'AU',
    'ఋ':'RRU','ౠ':'RRUU','ఌ':'LLU','ౡ':'LLUU',
    //കന്നട ഉയിരെഴുത്തുകൾ
    "ಅ":"A","ಆ":"Ā","ಇ":"I","ಈ":"Ī","ಉ":"U","ಊ":"Ū",
    "ಎ":"E","ಏ":"Ē","ಒ":"O","ಓ":"Ō","ಐ":"AI","ಔ":"AU",
    "ಋ":"RRU","ೠ":"RRUU","ಌ": "LLU", "ೡ":"LLUU",
    //ഗോണ്ടി ഉയിരെഴുത്തുകൾ
    "𑵠":"A","𑵡":"Ā","𑵢":"I","𑵣":"Ī","𑵤":"U","𑵥":"Ū",
    "𑵧":"Ē","𑵪":"Ō","𑵨":"AI","𑵫":"AU",
    //ഗ്രന്ത ഉയിരെഴുത്തുകൾ
     "𑌅":"A","𑌆":"Ā","𑌇":"I","𑌈":"Ī","𑌉":"U","𑌊":"Ū",
     "𑌏𑌀":"E","𑌏":"Ē","𑌓𑌀":"O","𑌓":"Ō","𑌐":"AI","𑌔":"AU",
     "𑌋":"RRU","𑍠":"RRUU","𑌌": "LLU", "𑍡":"LLUU",
    //മെയ്യെഴുത്തുകൾ 
    'ക':'ka','ಕ':'ka','க':'ka','క':'ka','𑵱':'ka','𑌕':'ka',
    'ഖ':'kha','ಖ':'kha','க₂':'kha','ఖ':'kha','𑵲':'kha','𑌖':'kha',
    'ഗ':'ga','ಗ':'ga','க₃':'ga','గ':'ga','𑵶':'ga','𑌗':'ga',
    'ഘ':'gha','ಘ':'gha','க₄':'gha','ఘ':'gha','𑵷':'gha','𑌘':'gha',
    'ങ':'ṅa','ಙ':'ṅa','ங':'ṅa','ఙ':'ṅa','𑶄':'ṅa','𑌙':'ṅa',
    // -----------------------------------------------
    'ച':'ca','ಚ':'ca','ச':'ca','చ':'ca','𑵻':'ca','𑌚':'ca',
    'ഛ':'cha','ಛ':'cha','ச₂':'cha','ఛ':'cha','𑵼':'cha','𑌛':'cha',
    'ജ':'ja','ಜ':'ja','ஜ':'ja','జ':'ja','𑶀':'ja','𑌜':'ja',
    'ഝ':'jha','ಝ':'jha','ஜ₂':'jha','ఝ':'jha','𑶁':'jha','𑌝':'jha',
    'ഞ':'ña','ಞ':'ña','ஞ':'ña','ఞ':'ña','𑌞':'ña',
    //------------------------------------------------
    'ട':'ṭa','ಟ':'ṭa','ட':'ṭa','ట':'ṭa','𑵽':'ṭa','𑌟':'ṭa',
    'ഠ':'ṭha','ಠ':'ṭha','ட₂':'ṭha','ఠ':'ṭha','𑵾':'ṭha','𑌠':'ṭha',
    'ഡ':'ḍa','ಡ':'ḍa','ட₃':'ḍa','డ':'ḍa','𑶂':'ḍa','𑌡':'ḍa',
    'ഢ':'ḍha','ಢ':'ḍha','ட₄':'ḍha','ఢ':'ḍha','𑶃':'ḍha','𑌢':'ḍha',
    'ണ':'ṇa','ಣ':'ṇa','ண':'ṇa','ణ':'ṇa','𑌣':'ṇa',
    //---------------------------------------------------
    'ത':'ta','ತ':'ta','த':'ta','త':'ta','𑵳':'ta','𑌤':'ta',
    'ഥ':'tha','ಥ':'tha','த₂':'tha','థ':'tha','𑵴':'tha','𑌥':'tha',
    'ദ':'da','ದ':'da','த₃':'da','ద':'da','𑵸':'da','𑌦':'da',
    'ധ':'dha','ಧ':'dha','த₄':'dha','ధ':'dha','𑵹':'dha','𑌧':'dha',
    'ന':'na','ನ':'na','ந':'na','న':'na','𑵺':'na','𑌨':'na',
    'ഩ':'ṉa','ನ಼':'ṉa','ன':'ṉa','𑌨𑌼':'ṉa',
    //---------------------------------------------------
    'പ':'pa','ಪ':'pa','ப':'pa','ప':'pa','𑶅':'pa','𑌪':'pa',
    'ഫ':'pha','ಫ':'pha','ப₂':'pha','ఫ':'pha','𑶆':'pha','𑌫':'pha',
    'ബ':'ba','ಬ':'ba','ப₃':'ba','బ':'ba','𑵮':'ba','𑌬':'ba',
    'ഭ':'bha','ಭ':'bha','ப₄':'bha','భ':'bha','𑵯':'bha','𑌭':'bha',
    'മ':'ma','ಮ':'ma','ம':'ma','మ':'ma','𑵰':'ma','𑌮':'ma',
    //-------------------------------------------------
    'യ':'ya','ಯ':'ya','ய':'ya','య':'ya','𑵬':'ya','𑌯':'ya',
    'ര':'ra','ರ':'ra','ர':'ra','ర':'ra','𑶈':'ra','𑌰':'ra',
    'ല':'la','ಲ':'la','ல':'la','ల':'la','𑵵':'la','𑌲':'la',
    'ള':'ḷa','ಳ':'ḷa','ள':'ḷa','ళ':'ḷa','𑵿':'ḷa','𑌳':'ḷa',
    'ഴ':'ḻa','ೞ':'ḻa','ழ':'ḻa','𑌳𑌼':'ḻa',
    //-------------------------------------------------
    'റ':'ṟa','ಱ':'ṟa','ற':'ṟa','ఱ':'ṟa','𑌰𑌼':'ṟa',
    'വ':'va','ವ':'va','வ':'va','వ':'va','𑵭':'va','𑌵':'va',
    'ശ':'śa','ಶ':'śa','ஶ':'śa','శ':'śa','𑌶':'śa',
    'ഷ':'ṣa','ಷ':'ṣa','ஷ':'ṣa','ష':'ṣa','𑌷':'ṣa',
    'സ':'sa','ಸ':'sa','ஸ':'sa','స':'sa','𑶉':'sa','𑌸':'sa',
    'ഹ':'ha','ಹ':'ha','ஹ':'ha','హ':'ha','𑶇':'ha','𑌹':'ha',
    'ം':'M','ಂ':'M','ం':'M','𑶕':'M','𑌂':'ṁ','ஂ':'M','ഀ':'M','ఄ':'M','𑍝':'M',
    'ഃ':'H','ಃ':'H','ః':'H','𑶖':'H','𑌃':'H','ః':'H',
    //-----------മറ്റു ചട്ടങ്ങൾ 
    //-----------------മെല്ലിനവല്ലിന ചട്ടങ്ങൾ 
    'ംക':'ṅka','ಂಕ':'ṅka','ంక':'ṅka','𑶕𑵱':'ṅka',
    'ംഖ':'ṅkha','ಂಖ':'ṅkha','ంఖ':'ṅkha','𑶕𑵲':'ṅkha',
    'ംഗ':'ṅga','ಂಗ':'ṅga','ంగ':'ṅga','𑶕𑵶':'ṅga',
    'ംഘ':'ṅgha','ಂಘ':'ṅgha','ంఘ':'ṅgha','𑶕𑵷':'ṅgha',

    'ಂಚ':'ñca','ంచ':'ñca','ంచ':'ñca','𑶕𑵻':'ñca',
    'ಂಛ':'ñcha','ంఛ':'ñcha','ంఛ':'ñcha','𑶕𑵼':'ñcha',
    'ಂಜ':'ñja','ంజ':'ñja','ంజ':'ñja','𑶕𑶀':'ñja',
    'ಂಝ':'ñjha','ంఝ':'ñjha','ంఝ':'ñjha','𑶕𑶁':'ñjha',

    'ಂಟ':'ṇṭa','ంట':'ṇṭa','𑶕𑵽':'ṇṭa',
    'ಂಠ':'ṇṭha','ంఠ':'ṇṭha','𑶕𑵾':'ṇṭha',
    'ಂಡ':'ṇḍa','ండ':'ṇḍa','𑶕𑶂':'ṇḍa',
    'ಂಢ':'ṇḍha','ంఢ':'ṇḍha','𑶕𑶃':'ṇḍha',

    'ಂತ':'nta','ంత':'nta','𑶕𑵳':'nta',
    'ಂಥ':'ntha','ంథ':'ntha','𑶕𑵴':'ntha',
    'ಂದ':'nda','ంద':'nda','𑶕𑵸':'nda',
    'ಂಧ':'ndha','ంధ':'ndha','𑶕𑵹':'ndha',
    //ചില്ലുകളും മറ്റും
    'ൿ':'k̊','ൺ':'ṇ̊','ൻ':'ṉ̊','ർ':'r̊','ൽ':'l̊','ൾ':'ḷ̊','ൖ':'ḻ̊','ൔ':'m̊','ൕ':'ẙ',
    'റ്റ':'ṯṯa','ന്റ':'ṉḏa','ಜ಼':'za','ಫ಼':'fa','ౚ':'ṉḏa','ౘ':'tsa','ౙ':'dza','𑌜𑌼':'za',
    'ற்ற':'ṯṟa',
    //-----മറ്റു കുറികളും എഴുത്തുകളും
    'ஃ':'ḵ','ఁ':'̃','ఀ':'̃','౷':'siddhirastu','ఽ':'’',
    'ಀ':'̃','ಁ':'̃','಄':'siddhirastu','ௐ':'ōṁ','௹':'rūpai','𑌽':'’','𑌁':'̃',
    'ഄ':'̃','ഁ':'̃','ഽ':'’','ൎ':'r̊','഼':'Ŭ','഻':'Ŭ','ഺ':'ṯa','𑶘':'ōṁ','𑍐':'ōṁ',
    // ഉയിരെഴുത്തു കുറികൾ 
    '്':'Ŭ','್':'ů','్':'ů','்':'ů','𑶗':'ů','𑍍':'ů',
    'ാ':'ā','ಾ':'ā','ா':'ā','ా':'ā','𑶊':'ā','𑌾':'ā',

    'ി':'i','ಿ':'i','ி':'i','ి':'i','𑶋':'i','𑌿':'i',
    'ീ':'ī','ೀ':'ī','ீ':'ī','ీ':'ī','𑶌':'ī','𑍀':'ī',

    'ു':'u','ು':'u','ு':'u','ు':'u','𑶍':'u','𑍁':'u',
    'ൂ':'ū','ೂ':'ū','ூ':'ū','ూ':'ū','𑶎':'ū','𑍂':'ū',
    
    'െ':'e','ೆ':'e','ெ':'e','ె':'e',"𑍇𑌀":"e",
    'േ':'ē','ೇ':'ē','ே':'ē','ే':'ē','𑶐':'ē','𑍇':'ē',
   
    'ൊ':'o','ೊ':'o','ொ':'o','ొ':'o',"𑍋𑌀":"o",
    'ോ':'ō','ೋ':'ō','ோ':'ō','ో':'ō','𑶓':'ō','𑍋':'ō',
    
    'ൈ':'ai','ೈ':'ai','ை':'ai','ై':'ai','𑶑':'ai','𑍈':'ai',
    'ೖ':'ai','ౖ':'ai',
    'ൌ':'au','ೌ':'au','ௌ':'au','ౌ':'au','𑶔':'au','𑍌':'au',
    'ൗ':'au','ௗ':'au','𑍗':'au',

    'ൃ':'r̥','ೃ':'r̥','ృ':'r̥','𑍃':'r̥',
    'ൄ':'r̥̄','ೄ':'r̥̄','ౄ':'r̥̄','𑍄':'r̥̄',
    'ൢ':'l̥','ೢ':'l̥','ౢ':'l̥','𑍢':'l̥',
    'ൣ':'l̥̄','ೣ':'l̥̄','ౣ':'l̥̄','𑍣':'l̥̄',

    //-- തമിഴ് മലയാളം മെല്ലിന ചട്ടങ്ങൾ 
    'ന്ത':'nta','ந்த':'nta',
    'ന്ഥ':'ntha','ந்த₂':'ntha',
    'ന്ദ':'nda','ந்த₃':'nda',
    'ന്ധ':'ndha','ந்த₄':'ndha',
     //അടിപ്പുള്ളി 
     "಼":"","𑌼":"",
    //--എണ്ണങ്ങൾ
    '൧':'1','௧':'1','౧':'1','𑶡':'1',
    '൨':'2','௨':'2','౨':'2','𑶢':'2',
    '൩':'3','௩':'3','౩':'3','𑶣':'3',
    '൪':'4','௪':'4','౪':'4','𑶤':'4',
    '൫':'5','௫':'5','౫':'5','𑶥':'5',
    '൬':'6','௬':'6','౬':'6','𑶦':'6',
    '൭':'7','௭':'7','౭':'7','𑶧':'7',
    '൮':'8','௮':'8','౮':'8','𑶨':'8',
    '൯':'9','௯':'9','౯':'9','𑶩':'9',
    '൦':'0','௦':'0','౦':'0','𑶠':'0',

    '൰':'10','௰':'10',
    '൱':'100','௱':'100',
    '൲':'1000','௲':'1000',
};

const iso = {
    'A':'a','Ā':'ā','I':'i','Ī':'ī','U':'u','Ū':'ū',
    'E':'e','Ē':'ē','O':'o','Ō':'ō','AI':'ai','AU':'au',
    'RRU':'r̥','RRUU':'r̥̄','LLU':'l̥','LLUU':'l̥̄',
    //----------------------
    'M':'m','H':'ḥ','ů':'',
    //--ചില്ലുകൾ
    'k̊':'k','ṇ̊':'ṇ','ṉ̊':'ṉ','r̊':'r','l̊':'l','ḷ̊':'ḷ','ḻ̊':'ḻ','m̊':'m','ẙ':'y',
}
const ipa = {
    "A":"ə","Ā":"aː","I":"i","Ī":"iː","U":"u","Ū":"uː",
    "E":"e","Ē":"eː","O":"o","Ō":"oː","AI":"ஐ","AU":"ஔ",
    "RRU":"ɾɨ̆","RRUU":"ɾɨː","LLU":"lɨ̆","LLUU":"lɨː",
    'ů':'','a':'ə',
    "ā":"aː","i":"i","ī":"iː","u":"u","ū":"uː","e":"e","ē":"eː",
    "o":"o","ō":"oː","ai":"ai","au":"au","r̥":"ɾɨ̆","r̥̄":"ɾɨ̆","l̥̄":'lɨː',"l̥":'lɨ̆',

    "k":"k","kh":"kʰ","g":"ɡ","gh":"ɡʱ","ṅ":"ŋ",
    "c":"t͡ʃ","ch":"t͡ʃʰ","j":"d͡ʒ","jh":"d͡ʒʱ","ñ":"ɲ",
    "ṭ":"ʈ","ṭh":"ʈʰ","ḍ":"ɖ","ḍh":"ɖʱ","ṇ":"ɳ",
    "t":"t̪","th":"t̪ʰ","d":"d̪","dh":"d̪ʱ","n":"n̪","ṉ":"n",
    "p":"p","ph":"pʰ","b":"b","bh":"bʱ","m":"m",
    "f":"f",
    "y":"j","r":"ɾ","l":"l","ḷ":"ɭ","ḻ":"ɻ","ṟ":"r",
    "v":"ʋ","ś":"ʃ","ṣ":"ʂ","s":"s","h":"h","M":"m","ṁ":"m",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"ŋk","ṅkh":"ŋkʰ","ṅg":"ŋɡ","ṅgh":"ŋɡʱ",
    "ñc":"ɲt͡ʃ","ñch":"ɲt͡ʃʰ","ñj":"ɲd͡ʒ","ñjh":"ɲd͡ʒʱ",
    "ṇṭ":"ɳt̪","ṇṭh":"ɳt̪ʰ","ṇḍ":"ɳd̪","ṇḍh":"ɳd̪ʱ",
    // മറ്റു ചട്ടങ്ങൾ 
    "ṯṯ":"tt","ṉḏ":"nd","ṯṟ":"tr",'̊':'','H':'h','ōṁ':'oːm','̃':'ə̃',
    'z':'z','ts':'t̪s','dz':'d̪z','ṉ̊':'n',
}
const mal = {
    "A":"അ","Ā":"ആ","I":"ഇ","Ī":"ഈ","U":"ഉ","Ū":"ഊ",
    "E":"എ","Ē":"ഏ","O":"ഒ","Ō":"ഓ","AI":"ഐ","AU":"ഔ",
    "RRU":"ഋ","RRUU":"ൠ","LLU":"ഌ","LLUU":"ൡ",
    'ů':'്','a':'','Ŭ':'്','ḵ':'ക്ക',
    "ā":"ാ","i":"ി","ī":"ീ","u":"ു","ū":"ൂ","e":"െ","ē":"േ",
    "o":"ൊ","ō":"ോ","ai":"ൈ","au":"ൗ","r̥":"ൃ","r̥̄":"ൄ","l̥̄":'ൣ',"l̥":'ൢ',

    "k":"ക","kh":"ഖ","g":"ഗ","gh":"ഘ","ṅ":"ങ",
    "c":"ച","ch":"ഛ","j":"ജ","jh":"ഝ","ñ":"ഞ",
    "ṭ":"ട","ṭh":"ഠ","ḍ":"ഡ","ḍh":"ഢ","ṇ":"ണ",
    "t":"ത","th":"ഥ","d":"ദ","dh":"ധ","n":"ന","ṉ":"ഩ",
    "p":"പ","ph":"ഫ","b":"ബ","bh":"ഭ","m":"മ",
    "f":"ഫ",
    "y":"യ","r":"ര","l":"ല","ḷ":"ള","ḻ":"ഴ","ṟ":"റ",
    "v":"വ","ś":"ശ","ṣ":"ഷ","s":"സ","h":"ഹ","M":"ം","ṁ":"ം",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"ംക","ṅkh":"ംഖ","ṅg":"ംഗ","ṅgh":"ംഘ",
    "ñc":"ഞ്ച","ñch":"ഞ്ഛ","ñj":"ഞ്ജ","ñjh":"ഞ്ഝ",
    "ṇṭ":"ണ്ട","ṇṭh":"ണ്ഠ","ṇḍ":"ണ്ഡ","ṇḍh":"ണ്ഢ",
    "nt":"ന്ത","nth":"ന്ഥ","nd":"ന്ദ","ndh":"ന്ധ",
    // മറ്റു ചട്ടങ്ങൾ     
    "ṯṯ":"റ്റ","ṉḏ":"ന്റ","ṯṟ":"റ്റ",'H':'ഃ','ōṁ':'ഓം','̃':'ഁ',
    'z':'സ','ts':'ത്സ','dz':'ദ്സ',
    'k̊':'ൿ','ṇ̊':'ൺ','ṉ̊':'ൻ','r̊':'ർ','l̊':'ൽ','ḷ̊':'ൾ','ḻ̊':'ൖ','m̊':'ൔ','ẙ':'ൕ',
}
const ta = {
    "A":"அ","Ā":"ஆ","I":"இ","Ī":"ஈ","U":"உ","Ū":"ஊ",
    "E":"எ","Ē":"ஏ","O":"ஒ","Ō":"ஓ","AI":"ஐ","AU":"ஔ",
    "RRU":"ரு","RRUU":"ரூ","LLU":"லு","LLUU":"லூ",
    "a":"",'ů':'்','Ŭ':'்','ḵ':'ஃ',
    "ā":"ா","i":"ி","ī":"ீ","u":"ு","ū":"ூ","e":"ெ","ē":"ே",
    "o":"ொ","ō":"ோ","ai":"ை","au":"ௌ","r̥":"்ரு","r̥̄":"்ரூ","l̥̄":'்லூ',"l̥":'்லு',

    "k":"க","kh":"க","g":"க","gh":"க","ṅ":"ங",
    "c":"ச","ch":"ச","j":"ஜ","jh":"ஜ","ñ":"ஞ",
    "ṭ":"ட","ṭh":"ட","ḍ":"ட","ḍh":"ட","ṇ":"ண",
    "t":"த","th":"த","d":"த","dh":"த","n":"ன"," n":" ந","ṉ":"ன",
    "p":"ப","ph":"ப","b":"ப","bh":"ப","m":"ம",
    "f":"ஃப",
    "y":"ய","r":"ர","l":"ல","ḷ":"ள","ḻ":"ழ","ṟ":"ற",
    "v":"வ","ś":"ஶ","ṣ":"ஷ","s":"ஸ","h":"ஹ","M":"ம்","ṁ":"ம்",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"ங்க","ṅkh":"ங்க","ṅg":"ங்க","ṅgh":"ங்க",
    "ñc":"ஞ்ச","ñch":"ஞ்ச","ñj":"ஞ்ஜ","ñjh":"ஞ்ஜ",
    "ṇṭ":"ண்ட","ṇṭh":"ண்ட","ṇḍ":"ண்ட","ṇḍh":"ண்ட",
    "nt":"ந்த","nth":"ந்த","nd":"ந்த","ndh":"ந்த",
    // മറ്റു ചട്ടങ്ങൾ
    "ṯṯ":"ற்ற","ṉḏ":"ன்ற","ṯṟ":"ற்ற",'̊':'்','H':'ஹ','ōṁ':'ௐ','̃':'ங்',
    'z':'ஃஜ','ts':'த்ஸ','dz':'த்ஃஜ',
    
}
const kan = {
    "A":"ಅ","Ā":"ಆ","I":"ಇ","Ī":"ಈ","U":"ಉ","Ū":"ಊ",
    "E":"ಎ","Ē":"ಏ","O":"ಒ","Ō":"ಓ","AI":"ಐ","AU":"ಔ",
    "RRU":"ಋ","RRUU":"ೠ","LLU":"ಌ","LLUU":"ೡ",
    'ů':'್','a':'','Ŭ':'್','ḵ':'ಕ್ಕ',
    "ā":"ಾ","i":"ಿ","ī":"ೀ","u":"ಿು","ū":"ಿೂ","e":"ೆ","ē":"ೇ",
    "o":"ೊ","ō":"ೋ","ai":"ೈ","au":"ೌ","r̥":"ೃ","r̥̄":"ೄ","l̥":'ೢ',"l̥̄":'ೣ',

    "k":"ಕ","kh":"ಖ","g":"ಗ","gh":"ಘ","ṅ":"ಙ",
    "c":"ಚ","ch":"ಛ","j":"ಜ","jh":"ಝ","ñ":"ಞ",
    "ṭ":"ಟ","ṭh":"ಠ","ḍ":"ಡ","ḍh":"ಢ","ṇ":"ಣ",
    "t":"ತ","th":"ಥ","d":"ದ","dh":"ಧ","n":"ನ","ṉ":"ನ",
    "p":"ಪ","ph":"ಫ","b":"ಬ","bh":"ಭ","m":"ಮ",
    "f":"ಫ಼",
    "y":"ಯ","r":"ರ","l":"ಲ","ḷ":"ಳ","ḻ":"ೞ","ṟ":"ಱ",
    "v":"ವ","ś":"ಶ","ṣ":"ಷ","s":"ಸ","h":"ಹ","M":"ಂ","ṁ":"ಂ",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"ಂಕ","ṅkh":"ಂಖ","ṅg":"ಂಗ","ṅgh":"ಂಘ",
    "ñc":"ಂಚ","ñch":"ಂಛ","ñj":"ಂಜ","ñjh":"ಂಝ",
    "ṇṭ":"ಂಟ","ṇṭh":"ಂಠ","ṇḍ":"ಂಡ","ṇḍh":"ಂಢ",
    'nt':'ಂತ','nth':'ಂಥ','nd':'ಂದ','ndh':'ಂಧ',
    // മറ്റു ചട്ടങ്ങൾ 
    "ṯṯ":"ಱ್ಱ","ṉḏ":"ನ್ಱ","ṯṟ":"ಱ್ಱ",'H':'ಃ','ōṁ':'ಓಂ','̃':'ಁ','̊':'್',
    'z':'ಜ಼','ts':'ತ್ಸ','dz':'ದ್ಸ',
}
const tel = {
    "A":"అ","Ā":"ఆ","I":"ఇ","Ī":"ఈ","U":"ఉ","Ū":"ఊ",
    "E":"ఎ","Ē":"ఏ","O":"ఒ","Ō":"ఓ","AI":"ఐ","AU":"ఔ",
    "RRU":"ఋ","RRUU":"ౠ","LLU":"ఌ","LLUU":"ౡ",
    'ů':'్','a':'','Ŭ':'్','ḵ':'క్క',
    "ā":"ా","i":"ి","ī":"ీ","u":"ు","ū":"ూ","e":"ె","ē":"ే",
    "o":"ొ","ō":"ో","ai":"ై","au":"ౌ","r̥":"ృ","r̥̄":"ౄ","l̥":'ౢ',"l̥̄":'ౣ',

    "k":"క","kh":"ఖ","g":"గ","gh":"ఘ","ṅ":"ఙ",
    "c":"చ","ch":"ఛ","j":"జ","jh":"ఝ","ñ":"ఞ",
    "ṭ":"ట","ṭh":"ఠ","ḍ":"డ","ḍh":"ఢ","ṇ":"ణ",
    "t":"త","th":"థ","d":"ద","dh":"ధ","n":"న","ṉ":"న",
    "p":"ప","ph":"ఫ","b":"బ","bh":"భ","m":"మ",
    "f":"ఫ",
    "y":"య","r":"ర","l":"ల","ḷ":"ళ","ḻ":"ళ","ṟ":"ఱ",
    "v":"వ","ś":"శ","ṣ":"ష","s":"స","h":"హ","M":"ం","ṁ":"ం",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"ంక","ṅkh":"ంఖ","ṅg":"ంగ","ṅgh":"ంఘ",
    "ñc":"ంచ","ñch":"ంఛ","ñj":"ంజ","ñjh":"ంఝ",
    "ṇṭ":"ంట","ṇṭh":"ంఠ","ṇḍ":"ండ","ṇḍh":"ంఢ",
    'nt':'ంత','nth':'ంథ','nd':'ంద','ndh':'ంధ',
    // മറ്റു ചട്ടങ്ങൾ 
    "ṯṯ":"ఱ్ఱ","ṉḏ":"ౚ","ṯṟ":"ఱ్ఱ",'H':'ః','ōṁ':'ఓం','̃':'ఀ','̊':'్',
    'z':'ౙ','ts':'ౘ','dz':'ౙ',
}
const gra = {
    "A":"𑌅","Ā":"𑌆","I":"𑌇","Ī":"𑌈","U":"𑌉","Ū":"𑌊",
    "E":"𑌏𑌀","Ē":"𑌏","O":"𑌓𑌀","Ō":"𑌓","AI":"𑌐","AU":"𑌔",
    "RRU":"𑌋","RRUU":"𑍠","LLU":"𑌌","LLUU":"𑍡",
    'ů':'𑍍','a':'','Ŭ':'𑍍','ḵ':'𑌼',
    "ā":"𑌾","i":"𑌿","ī":"𑍀","u":"𑍁","ū":"𑍂","e":"𑍇𑌀","ē":"𑍇",
    "o":"𑍋𑌀","ō":"𑍋","ai":"𑍈","au":"𑍗","r̥":"𑍃","r̥̄":"𑍄","l̥":'𑍢',"l̥̄":'𑍣',

    "k":"𑌕","kh":"𑌖","g":"𑌗","gh":"𑌘","ṅ":"𑌙",
    "c":"𑌚","ch":"𑌛","j":"𑌜","jh":"𑌝","ñ":"𑌞",
    "ṭ":"𑌟","ṭh":"𑌠","ḍ":"𑌡","ḍh":"𑌢","ṇ":"𑌣",
    "t":"𑌤","th":"𑌥","d":"𑌦","dh":"𑌧","n":"𑌨","ṉ":"𑌨𑌼",
    "p":"𑌪","ph":"𑌫","b":"𑌬","bh":"𑌭","m":"𑌮",
    "f":"𑌫𑌼",
    "y":"𑌯","r":"𑌰","l":"𑌲","ḷ":"𑌳","ḻ":"𑌳𑌼","ṟ":"𑌰𑌼",
    "v":"𑌵","ś":"𑌶","ṣ":"𑌷","s":"𑌸","h":"𑌹","M":"𑌂","ṁ":"𑌂",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"𑌙𑍍𑌕","ṅkh":"𑌙𑍍𑌖","ṅg":"𑌙𑍍𑌗","ṅgh":"𑌙𑍍𑌘",
    "ñc":"𑌞𑍍𑌚","ñch":"𑌞𑍍𑌛","ñj":"𑌞𑍍𑌜","ñjh":"𑌞𑍍𑌝",
    "ṇṭ":"𑌣𑍍𑌟","ṇṭh":"𑌣𑍍𑌠","ṇḍ":"𑌣𑍍𑌡","ṇḍh":"𑌣𑍍𑌢",
    "nt":"𑌨𑍍𑌤","nth":"𑌨𑍍𑌥","nd":"𑌨𑍍𑌦","ndh":"𑌨𑍍𑌧",
    // മറ്റു ചട്ടങ്ങൾ
    "ṯṯ":"𑌰𑌼𑍍𑌰𑌼","ṉḏ":"𑌨𑌼𑍍𑌰𑌼","ṯṟ":"𑌰𑌼𑍍",'H':'𑌃','ōṁ':'𑍐','̃':'𑌁','̊':'𑍍',
    'z':'𑌜𑌼','ts':'𑌤𑍍𑌸','dz':'𑌦𑍍𑌜𑌼',
}
const gon = {
    "A":"𑵠","Ā":"𑵡","I":"𑵢","Ī":"𑵣","U":"𑵤","Ū":"𑵥",
    "E":"𑵧","Ē":"𑵧","O":"𑵪","Ō":"𑵪","AI":"𑵪","AU":"𑵫",
    "RRU":"𑶈𑶍","RRUU":"𑶈𑶎","LLU":"𑵵𑶍","LLUU":"𑵵𑶎",
    'ů':'𑶗','a':'','Ŭ':'𑶗','ḵ':'𑵱𑶖',
    "ā":"𑶊","i":"𑶋","ī":"𑶌","u":"𑶍","ū":"𑶎","e":"𑶐","ē":"𑶐",
    "o":"𑶓","ō":"𑶓","ai":"𑶑","au":"𑶔","r̥":"𑶕𑶈𑶍","r̥̄":"𑶕𑶈𑶎","l̥":'𑶕𑵵𑶍',"l̥̄":'𑶕𑵵𑶎',

    "k":"𑵱","kh":"𑵲","g":"𑵶","gh":"𑵷","ṅ":"𑶄",
    "c":"𑵻","ch":"𑵼","j":"𑶀","jh":"𑶁","ñ":"𑵺",
    "ṭ":"𑵽","ṭh":"𑵾","ḍ":"𑶂","ḍh":"𑶃","ṇ":"𑵺",
    "t":"𑵳","th":"𑵴","d":"𑵸","dh":"𑵹","n":"𑵺","ṉ":"𑵺",
    "p":"𑶅","ph":"𑶆","b":"𑵮","bh":"𑵯","m":"𑵰",
    "f":"𑶆",
    "y":"𑵬","r":"𑶈","l":"𑵵","ḷ":"𑵿","ḻ":"𑵿","ṟ":"𑶈",
    "v":"𑵭","ś":"𑶉","ṣ":"𑶉","s":"𑶉","h":"𑶇","M":"𑶕","ṁ":"𑶕",
    // മെല്ലിനവല്ലിന ചട്ടങ്ങൾ
    "ṅk":"𑶕𑵱","ṅkh":"𑶕𑵲","ṅg":"𑶕𑵶","ṅgh":"𑶕𑵷",
    "ñc":"𑶕𑵻","ñch":"𑶕𑵼","ñj":"𑶕𑶀","ñjh":"𑶕𑶁",
    "ṇṭ":"𑶕𑵽","ṇṭh":"𑶕𑵾","ṇḍ":"𑶕𑶂","ṇḍh":"𑶕𑶃",
    'nt':'𑶕𑵳','nth':'𑶕𑵴','nd':'𑶕𑵸','ndh':'𑶕𑵹',
    // മറ്റു ചട്ടങ്ങൾ
    "ṯṯ":"𑶈𑶕𑶈","ṉḏ":"𑵺𑶕𑶈","ṯṟ":"𑶈𑶕𑶈",'H':'𑶖','ōṁ':'𑶘','̃':'𑶕𑵺','̊':'𑶗',
    'z':'𑶀','ts':'𑵳𑶕𑶉','dz':'𑵸𑶕𑶀',
}
const armal = {
    "A":"اَ","Ā":"آ","I":"اِ","Ī":"اِي","U":"اُ","Ū":"اُو",
    "E":"ا٘","Ē":"ا٘ی","O":"اٗ","Ō":"اٗو","AI":"اَيْ","AU":"اَوْ",
    "RRU":"رْ","RRUU":"رّْ","LLU":"لْ","LLUU":"لّْ",
    'ů':'ْ','a':'َ','ḵ':'ق','Ŭ':'ْ',
    "ā":"اَ","i":"ِ","ī":"ىِ","u":"ُ","ū":"وُ","e":"ࣣ","ē":"ىࣣ",
    "o":"ٗ","ō":"وٗ","ai":"َيْ","au":"َوْ","r̥":"رْ","r̥̄":"رّْ","l̥̄":'لّْ',"l̥":'لْ',

    "k":"ک","kh":"كھ","g":"گ","gh":"گھ","ṅ":"ۼ",
    "c":"چ","ch":"چھ","j":"ج","jh":"جھ","ñ":"ڿ",
    "ṭ":"ڊ","ṭh":"ڊھ","ḍ":"ڗ","ḍh":"ڗھ","ṇ":"ڹ",
    "t":"ت","th":"تھ","d":"د","dh":"دھ","n":"ن","ṉ":"ن",
    "p":"پ","ph":"پھ","b":"ب","bh":"بھ","m":"م",
    "f":"ف",
    "y":"ي","r":"ڔ","l":"ل","ḷ":"ۻ","ḻ":"ژ","ṟ":"ر",
    "v":"و","ś":"ش","ṣ":"ۺ","s":"س","h":"ھ","M":"مْ","ṁ":"مْ",
    
    "ṯṯ":"ڔّ","ṉḏ":"نر","ṯṟ":"ڔّ",'H':'ه','ōṁ':'اٗومْ','̃':'',
    'z':'ز','ts':'تس','dz':'دز','̊':'ْ',
    'k̊':'کْ','ṇ̊':'ڹْ','ṉ̊':'نْ','r̊':'رْ','l̊':'لْ','ḷ̊':'ۻْ','ḻ̊':'ژْ','m̊':'مْ','ẙ':'يْ',
    
}
// കയറ്റുമതി
export {DravISO, ta, iso,ipa, mal, kan,tel, gra, gon,armal};
